app/views/main/home.html.erb

<div class="row center testimonies">
	<% Testimony.all[0..2].each do |testimony| %>
---
SELECT `testimonies`.* FROM `testimonies`