app/views/faqs/_form.html.erb

    <%= f.label :faq_section_id, 'Categoría', :class => 'control-label' %><br>
	<%= f.collection_select :faq_section_id, FaqSection.all, :id, :name, {prompt: "¿A qué sección pertenece?"}, {class: "form-control"} %>
---
SELECT `faq_sections`.* FROM `faq_sections`