app/views/faqs/index.html.erb

      <tr>
        <td><%= faq.faq_section.name unless faq.faq_section.blank? %></td>
---
SELECT `faqs`.* FROM `faqs`