app/views/information_pages/show.html.erb

<div style="margin-left:20px">
	<% @information_page.information_page_contents.each do |ipc| %>
---
SELECT `information_page_contents`.* FROM `information_page_contents` WHERE `information_page_contents`.`information_page_id` = 1