app/views/orders/_payment_modal.html.erb

      <div class="modal-body">
		<p>Realiza la transferencia de <b><%= number_to_currency @order.order_storage_items.joins(:storage_item).sum('price'), precision: 0 %></b> a la siguiente cuenta:</p>
---
SELECT SUM(price) AS sum_id FROM `order_storage_items` INNER JOIN `storage_items` ON `storage_items`.`id` = `order_storage_items`.`storage_item_id` WHERE `order_storage_items`.`order_id` = 6
SELECT `storage_items`.* FROM `storage_items` INNER JOIN `order_storage_items` ON `storage_items`.`id` = `order_storage_items`.`storage_item_id` WHERE `order_storage_items`.`order_id` = 6