app/views/orders/index.html.erb

SELECT `orders`.* FROM `orders`
---
				<p>
					Status: <b><%= order.order_status.name %></b>

SELECT SUM(price) AS sum_id FROM `order_storage_items` INNER JOIN `storage_items` ON `storage_items`.`id` = `order_storage_items`.`storage_item_id` WHERE `order_storage_items`.`order_id` = 6
---
				</p>
				<p>Precio total: <b><%= number_to_currency order.order_storage_items.joins(:storage_item).sum('price'), precision: 0 %></b></p>

SELECT `order_storage_items`.* FROM `order_storage_items` WHERE `order_storage_items`.`order_id` = 6
---
					<tbody>
						<% order.order_storage_items.each do |osi| %>

SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 6 LIMIT 1
---
							<td><%= order.address.post_code %></td>
							<td><%= order.address.area.name unless order.address.area.blank? %></td>