app/views/orders/new.html.erb

		<div class="form-group">
			<%= collection_select(:order_area, :area, Area.all, :id, :name, { :prompt => 'Selecciona tu área' }, { :class => 'form-control' }) %>
---
SELECT `areas`.* FROM `areas`