app/views/orders/step2.html.erb

						<th>Area</th>
						<td><%= @address.area.name unless @address.area.blank? %></td>
---
SELECT `areas`.* FROM `areas`