app/views/orders/step3.html.erb

		<table class="table" style="width:500px; margin:0 auto;">
			<% @order.storage_items.uniq.each do |si| %>
---
SELECT `order_storage_items`.* FROM `order_storage_items` WHERE `order_storage_items`.`order_id` = 1

				<th>Total</th>
				<th><%= number_to_currency @order.order_storage_items.joins(:storage_item).sum('price'), precision: 0 %></th>
---
SELECT SUM(quantity*price) AS sum_id FROM `order_storage_items` INNER JOIN `storage_items` ON `storage_items`.`id` = `order_storage_items`.`storage_item_id` WHERE `order_storage_items`.`order_id` = 1
SELECT `storage_items`.* FROM `storage_items` INNER JOIN `order_storage_items` ON `storage_items`.`id` = `order_storage_items`.`storage_item_id` WHERE `order_storage_items`.`order_id` = 6

				<th>Area</th>
				<td><%= @order.address.area unless @order.address.blank? %></td>
---
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 5 LIMIT 1