app/views/addresses/_form.html.erb

		<p><%= f.text_field :phone_number, placeholder: 'Teléfono de contacto', :class => 'form-control' %></p>
	    <p><%= f.collection_select(:area_id, Area.all, :id, :name, { :prompt => 'Selecciona tu área' }, { :class => 'form-control' }) %></p>
---
SELECT `areas`.* FROM `areas`