app/views/countries/show.html.erb

SELECT `areas`.* FROM `areas` WHERE `areas`.`country_id` = 1
---
<div style="margin-left:20px">
	<% @country.areas.each do |area| %>