app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)
    @address.save
---
INSERT INTO `addresses` (`area_id`, `created_at`, `name`, `post_code`, `receiver`, `updated_at`, `user_id`) VALUES (2, '2014-10-10 01:35:39', 'Por ahí', '2200011', 'Rodrigo', '2014-10-10 01:35:39', 10)

  def update
    @address.update(address_params)
---
UPDATE `addresses` SET `phone_number` = '123113', `updated_at` = '2014-10-10 01:36:50' WHERE `addresses`.`id` = 7

    def set_address
      @address = Address.find(params[:id])
---
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 6 LIMIT 1