app/controllers/countries_controller.rb

SELECT `countries`.* FROM `countries`
---
  def index
    add_breadcrumb "Administrador", admin_path
    add_breadcrumb "Países", countries_path

    @countries = Country.all

INSERT INTO `countries` (`created_at`, `name`, `updated_at`) VALUES ('2014-10-06 21:56:42', 'Chile', '2014-10-06 21:56:42')
---
  def create
    @country = Country.new(country_params)

    respond_to do |format|
      if @country.save

SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
---
    def set_country
      @country = Country.find(params[:id])