app/controllers/faq_sections_controller.rb

  def index
    add_breadcrumb "Administrador", admin_path
    add_breadcrumb "Secciones de las Preguntas Frecuentes", faq_sections_path

    @faq_sections = FaqSection.all
---
SELECT `faq_sections`.* FROM `faq_sections`

  def create
    @faq_section = FaqSection.new(faq_section_params)

    respond_to do |format|
      if @faq_section.save
---
INSERT INTO `faq_sections` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-10-06 20:59:34', 'Lo básico que necesitas saber', 'Preguntas Generales', '2014-10-06 20:59:34')

  def update
    respond_to do |format|
      if @faq_section.update(faq_section_params)
---
UPDATE `faq_sections` SET `description` = 'Lo básico que necesitas saber.', `updated_at` = '2014-10-06 21:00:48' WHERE `faq_sections`.`id` = 1

  def destroy
    @faq_section.destroy
---
DELETE FROM `faq_sections` WHERE `faq_sections`.`id` = 2

    def set_faq_section
      @faq_section = FaqSection.find(params[:id])
---
SELECT `faq_sections`.* FROM `faq_sections` WHERE `faq_sections`.`id` = 2 LIMIT 1