app/controllers/faqs_controller.rb

  def index
    add_breadcrumb "Administrador", admin_path
    add_breadcrumb "Preguntas Frecuentes", faqs_path

    @faqs = Faq.all
---
SELECT `faqs`.* FROM `faqs`

  def create
    @faq = Faq.new(faq_params)
    respond_to do |format|
      if @faq.save
---
INSERT INTO `faqs` (`answer`, `created_at`, `faq_section_id`, `question`, `updated_at`) VALUES ('Es un regalo de Dios!', '2014-10-06 21:05:17', 1, '¿Por qué existimos?', '2014-10-06 21:05:17')

    def set_faq
      @faq = Faq.find(params[:id])
---
SELECT `faqs`.* FROM `faqs` WHERE `faqs`.`id` = 1 LIMIT 1