app/controllers/information_pages_controller.rb

SELECT `information_pages`.* FROM `information_pages`
---
  def index
    add_breadcrumb "Administrador", admin_path
    add_breadcrumb "Páginas Informativas", information_pages_path

    @information_pages = InformationPage.all

INSERT INTO `information_pages` (`created_at`, `subtitle`, `title`, `updated_at`) VALUES ('2014-10-06 21:23:18', 'Subtítutlo 1', 'Título 1', '2014-10-06 21:23:18')
---
  def create
    @information_page = InformationPage.new(information_page_params)
    respond_to do |format|
      if @information_page.save

UPDATE `information_pages` SET `slug` = 'titulo-1', `updated_at` = '2014-10-06 21:27:55' WHERE `information_pages`.`id` = 1
---
  def update
    respond_to do |format|
      if @information_page.update(information_page_params)

DELETE FROM `information_pages` WHERE `information_pages`.`id` = 2
---
  def destroy
    @information_page.destroy

SELECT `information_pages`.* FROM `information_pages` WHERE `information_pages`.`id` = 2 LIMIT 1
---
    def set_information_page
      @information_page = InformationPage.friendly.find(params[:id])