app/controllers/main_controller.rb

  def faqs
    @faq_sections = FaqSection.all
---
SELECT `faq_sections`.* FROM `faq_sections`

  def orders
    add_breadcrumb "Administrador", admin_path
    add_breadcrumb "Administrar Ordenes", main_orders_path

    order_status = OrderStatus.find_by_name('Transfer waiting approval')
    @orders = Order.where('order_status_id = ?', order_status.id).order('created_at DESC')
---
SELECT `order_statuses`.* FROM `order_statuses` WHERE `order_statuses`.`name` = 'Transfer waiting approval' LIMIT 1
SELECT `orders`.* FROM `orders` WHERE (order_status_id = 4) ORDER BY created_at DESC

  def destroy_order_storage_item
    @order_storage_item = OrderStorageItem.find(params[:id])
    notice = @order_storage_item.storage_item.name+' id # '+@order_storage_item.id.to_s+' eliminado de la orden '+@order_storage_item.order.id.to_s
    @order_storage_item.destroy
---
SELECT `order_storage_items`.* FROM `order_storage_items` WHERE `order_storage_items`.`id` = 21 LIMIT 1
SELECT `storage_items`.* FROM `storage_items` WHERE `storage_items`.`id` = 2 LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 6 LIMIT 1
DELETE FROM `order_storage_items` WHERE `order_storage_items`.`id` = 21

  def update_order_storage_item
    @order_storage_item = OrderStorageItem.find(params[:id])
    respond_to do |format|
      if @order_storage_item.update(order_storage_item_params)
---
SELECT `order_storage_items`.* FROM `order_storage_items` WHERE `order_storage_items`.`id` = 24 LIMIT 1
UPDATE `order_storage_items` SET `photo_file_name` = 'despacho.jpg', `photo_content_type` = 'image/jpeg', `photo_file_size` = 251839, `photo_updated_at` = '2014-10-09 23:39:45', `updated_at` = '2014-10-09 23:39:46' WHERE `order_storage_items`.`id` = 24