app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders`
---
  def index
    add_breadcrumb "Menú Principal", user_main_menu_path
    add_breadcrumb "Pedidos", orders_path

    @h1 = 'Tus Pedidos'
    @orders = current_user.orders