app/controllers/orders_controller.rb

  def index
    add_breadcrumb "Menú Principal", user_main_menu_path
    add_breadcrumb "Pedidos", orders_path

    @h1 = 'Tus Pedidos'
    step1 = OrderStatus.find_by_name('Step 1')
    step2 = OrderStatus.find_by_name('Step 2')

    @in_warehouse = OrderStorageItemStatus.find_by_name('In warehouse')
    @return_in_progress = OrderStorageItemStatus.find_by_name('Return in progress')

    @orders = current_user.orders.where('order_status_id <> ? and order_status_id <> ?', step1.id, step2.id).order 'created_at DESC'
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 10

  def step1
    if params[:order_area][:area].blank?
      redirect_to new_order_path, alert: 'Debes seleccionar el sector donde entregaremos las cajas'
    else
      order_status = OrderStatus.find_by_name('Step 1')
      @order = Order.create(order_status_id: order_status.id)
      osis = OrderStorageItemStatus.find_by_name('Waiting funds confirmation')

      if is_number?(params[:boxes])
        si = StorageItem.find_by_name('Regular Boxes')
        count = params[:boxes].to_i
        (1..count).each do |i|
          OrderStorageItem.create(order_id: @order.id, storage_item_id: si.id, order_storage_item_status_id: osis.id, price: si.price, return_price: si.return_price)
---
SELECT `order_statuses`.* FROM `order_statuses` WHERE `order_statuses`.`name` = 'Step 1' LIMIT 1
INSERT INTO `orders` (`created_at`, `order_status_id`, `updated_at`) VALUES ('2014-10-08 18:27:12', 1, '2014-10-08 18:27:12')
SELECT `storage_items`.* FROM `storage_items` WHERE `storage_items`.`name` = 'Regular Boxes' LIMIT 1
INSERT INTO `order_storage_items` (`created_at`, `order_id`, `quantity`, `storage_item_id`, `updated_at`) VALUES ('2014-10-08 18:27:12', 1, 16, 2, '2014-10-08 18:27:12')

  def step2
		@address = current_user.default_address if user_signed_in?
		@area = Area.find params[:area]

    if request.patch?
      if @address.blank? and (params[:area].blank? or params[:name].blank? or params[:receiver].blank? or params[:phone_number].blank?)
        flash[:alert] = "Debes ingresar la información completa para poder ir a dejarte las cajas y recoger los items!"
        render :template => "orders/step2"
      elsif !params[:company].blank? and (params[:company_name].blank? or params[:rut].blank?)
        flash[:alert] = "Debes agregar los datos de la empresa (RUT y Nombre)!"
        render :template => "orders/step2"
      elsif ((params['collection-day'].blank? or params['collection-time'].blank?) and params['right_away'].blank?) or params['right_away'].blank?
        flash[:alert] = "Debes seleccionar cuando vamos a buscar las cajas!"
        render :template => "orders/step2"
      else
        if User.find_by_email(params[:email]).blank?
          unless user_signed_in?
            user = User.new(:email => params[:email], :password => params[:password], :password_confirmation => params[:password], :name => params[:username])
            user.save
            sign_in user
          else
            user = current_user
          end
          if params[:address_id].blank?
            address = Address.create(default: true, area_id: params[:area], user_id: user.id, name: params[:name], post_code: params[:post_code], receiver: params[:receiver], phone_number: params[:phone_number])
          else
            address = Address.find params[:address_id]
          end
          @order.update_attribute :address_id, address.id

          order_status = OrderStatus.find_by_name('Step 2')
---
SELECT `areas`.* FROM `areas`
SELECT 1 AS one FROM `users` WHERE `users`.`email` = BINARY 'asdads@oooasda.com' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'oo@oo.com' LIMIT 1
INSERT INTO `addresses` (`created_at`, `name`, `phone_number`, `post_code`, `receiver`, `updated_at`, `user_id`) VALUES ('2014-10-08 22:25:13', 'Camino Otoñal 1150 casa C', '92778993', '10012', 'Ximena', '2014-10-08 22:25:13', 9)
INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `sign_in_count`, `updated_at`) VALUES ('2014-10-08 22:24:27', '2014-10-08 22:24:27', '127.0.0.1', 'asdads@oooasda.com', '$2a$10$mJKjXy5nuEDK4z6QyCSGJOpAHVKczKADkDTX4Pf4xfr3OJ47QpfJC', '2014-10-08 22:24:27', '127.0.0.1', 1, '2014-10-08 22:24:27')
UPDATE `orders` SET `collection_date` = '2014-10-13 00:00:00', `updated_at` = '2014-10-08 22:24:27' WHERE `orders`.`id` = 1
UPDATE `users` SET `last_sign_in_at` = '2014-10-08 22:25:13', `current_sign_in_at` = '2014-10-08 22:25:13', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2014-10-08 22:25:13' WHERE `users`.`id` = 9
SELECT `order_statuses`.* FROM `order_statuses` WHERE `order_statuses`.`name` = 'Step 2' LIMIT 1

  def transfer_confirmed
    order_status = OrderStatus.find_by_name('Transfer waiting approval')
    @order.update_attribute :order_status_id, order_status.id
---
SELECT `order_statuses`.* FROM `order_statuses` WHERE `order_statuses`.`name` = 'Transfer waiting approval' LIMIT 1
UPDATE `orders` SET `order_status_id` = 4, `updated_at` = '2014-10-09 21:57:28' WHERE `orders`.`id` = 6

    def set_order_storage_item
      @order_storage_item = OrderStorageItem.find(params[:order_storage_item_id])
---
SELECT `order_storage_items`.* FROM `order_storage_items` WHERE `order_storage_items`.`order_id` = 6
SELECT `storage_items`.* FROM `storage_items` WHERE `storage_items`.`id` = 2 LIMIT 1