app/controllers/stored_items_controller.rb

  def index
    add_breadcrumb "Menú Principal", user_main_menu_path
    add_breadcrumb "Inventario", stored_items_path

    @in_warehouse = OrderStorageItemStatus.find_by_name('In warehouse')
    @waiting_funds = OrderStorageItemStatus.find_by_name('Wating funds confirmation for return')
    @return_in_progress = OrderStorageItemStatus.find_by_name('Return in progress')


    unless params[:q].blank?
      @q = params[:q]
      @stored_items = current_user.stored_items.joins(:order_storage_item).where('order_storage_items.order_storage_item_status_id in (?)', [@in_warehouse.id, @return_in_progress.id, @waiting_funds.id]).where('stored_items.order_storage_item_id = "'+@q+'" or stored_items.name like "%'+@q+'%" or stored_items.description like "%'+@q+'%" or order_storage_items.name like "%'+@q+'%"').uniq
---
SELECT DISTINCT `order_storage_items`.* FROM `order_storage_items` INNER JOIN `stored_items` ON `stored_items`.`order_storage_item_id` = `order_storage_items`.`id` INNER JOIN `orders` ON `order_storage_items`.`order_id` = `orders`.`id` WHERE `orders`.`user_id` = 10 AND (stored_items.name like "%poler%" or stored_items.description like "%poler%")
SELECT DISTINCT `stored_items`.* FROM `stored_items` INNER JOIN `order_storage_items` ON `stored_items`.`order_storage_item_id` = `order_storage_items`.`id` INNER JOIN `orders` ON `order_storage_items`.`order_id` = `orders`.`id` WHERE `orders`.`user_id` = 10 AND (stored_items.name like "%poler%" or stored_items.description like "%poler%")