app/controllers/storage_items_controller.rb

  def index
    add_breadcrumb "Administrador", admin_path
    add_breadcrumb "Storage Items", storage_items_path

    @storage_items = StorageItem.all
---
SELECT `storage_items`.* FROM `storage_items`

  def create
    @storage_item = StorageItem.new(storage_item_params)
    respond_to do |format|
      if @storage_item.save
---
INSERT INTO `storage_items` (`capacity`, `capacity_measure`, `created_at`, `depth`, `description`, `dimensions_measure`, `height`, `name`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `price`, `slug`, `updated_at`, `width`) VALUES (30, 'kgs', '2014-10-06 22:16:41', 20, 'Modelo 2 de la foto de por ahí', 'cms', 20, 'Modelo 2', 'image/jpeg', 'p2.jpg', 47742, '2014-10-06 22:16:40', 9990, 'modelo-2', '2014-10-06 22:16:41', 20)

    def set_storage_item
      @storage_item = StorageItem.friendly.find(params[:id])
---
SELECT `storage_items`.* FROM `storage_items` WHERE `storage_items`.`id` = 0 LIMIT 1