app/controllers/stored_items_controller.rb

SELECT `stored_items`.* FROM `stored_items`
---
  def index
    @stored_items = StoredItem.all