app/controllers/testimonies_controller.rb

  def index
    add_breadcrumb "Administrador", admin_path
    add_breadcrumb "Testimonios", testimonies_path

    @testimonies = Testimony.all
---
SELECT `testimonies`.* FROM `testimonies`

  def create
    @testimony = Testimony.new(testimony_params)

    respond_to do |format|
      if @testimony.save
---
INSERT INTO `testimonies` (`content`, `created_at`, `name`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `title`, `updated_at`) VALUES ('Me encanta porque puedo guardar todo', '2014-10-06 20:55:15', 'Dario Nocioni', 'image/jpeg', 'p4.jpg', 66467, '2014-10-06 20:55:14', 'VP Local', '2014-10-06 20:55:15')

  def update
    respond_to do |format|
      if @testimony.update(testimony_params)
---
UPDATE `testimonies` SET `name` = 'María Jesus Fernandez', `title` = 'Chef', `content` = 'Haberme casado y compartir mi casa con mi marido achicó mi closet. Ahora Warehouse me permite guardar mis cosas de fuera de temporada', `updated_at` = '2014-10-07 17:53:12' WHERE `testimonies`.`id` = 1

    def set_testimony
      @testimony = Testimony.find(params[:id])
---
SELECT `testimonies`.* FROM `testimonies` WHERE `testimonies`.`id` = 1 LIMIT 1