app/views/layouts/_footer.html.erb

	<div class="footer-menu">
		<% InformationPage.all.each do |ip| %>
---
SELECT `information_pages`.* FROM `information_pages`